arhovumyan/STM32/5_UART_TX/Src/main.c
#include "stm32f4xx.h"
#include <stdint.h>

#define GPIOAEN         (1U << 0)
#define UART2EN         (1U << 17)

#define CR1_TE          (1U << 3)
#define CR1_UE          (1U << 13)
#define SR_TXE          (1U << 7)

#define SYS_FREQ        16000000
#define APB1_CLK        SYS_FREQ

#define UART_BAUDRATE   115200

static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk, uint32_t BaudRate);
static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate);

void uart2_tx_init(void);
void uart2_write(int ch);

int main(void)
{
    uart2_tx_init();

    while (1)
    {
        uart2_write('Y');
    }
}

//sets up UART2 so the STM32 can send data through the TX pin which is PA2
void uart2_tx_init(void)
{
    /* Enable clock access to GPIOA */
    RCC->AHB1ENR |= GPIOAEN;

    /* Set PA2 mode to alternate function mode */
    // PA2 will now be controlled by USART2 peripheral
    GPIOA->MODER &= ~(1U << 4);
    GPIOA->MODER |=  (1U << 5);

    /* Set PA2 alternate function type to USART2_TX AF7 */
    GPIOA->AFR[0] &= ~(1U << 11);
    GPIOA->AFR[0] |=  (1U << 10);
    GPIOA->AFR[0] |=  (1U << 9);
    GPIOA->AFR[0] |=  (1U << 8);

    /* Enable clock access to USART2 */
    RCC->APB1ENR |= UART2EN;

    /* Configure baud rate */
    uart_set_baudrate(USART2, APB1_CLK, UART_BAUDRATE);

    /* Enable transmitter */
    USART2->CR1 |= CR1_TE;

    /* Enable UART module */
    USART2->CR1 |= CR1_UE;
}

//sends one character through UART
void uart2_write(int ch)
{
    /* Wait until transmit data register is empty */
    while (!(USART2->SR & SR_TXE)) {}

    /* Write data to transmit data register */
    USART2->DR = (ch & 0xFF);
}

static void uart_set_baudrate(USART_TypeDef *USARTx, uint32_t PeriphClk, uint32_t BaudRate)
{
    USARTx->BRR = compute_uart_bd(PeriphClk, BaudRate);
}
// clock speed / baudrate
static uint16_t compute_uart_bd(uint32_t PeriphClk, uint32_t BaudRate)
{
    return ((PeriphClk + (BaudRate / 2U)) / BaudRate);
}
